IDEA StatiCa Open Model
CutBeamByBeamData.IsWeld Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 is cut welded
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public bool IsWeld { get; set; }
Public Property IsWeld As Boolean
	Get
	Set
public:
property bool IsWeld {
	bool get ();
	void set (bool value);
}
Property Value
Type: Boolean
See Also
Reference
CutBeamByBeamData Class
IdeaRS.OpenModel.Connection Namespace